# SQL-2

## Setup the environment

In [1]:
pip install ipython-sql psycopg2

Requirement already satisfied: ipython-sql in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (0.5.0)
Requirement already satisfied: psycopg2 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (2.9.10)
Requirement already satisfied: prettytable in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: ipython in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (8.31.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (2.0.37)
Requirement already satisfied: sqlparse in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: colorama in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\sarth\onedrive\desktop\sems\sem6\col362\inclasstutorials\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

Refer to SQL-01.ipynb notebook for setting up the test database in PostgreSQL DB

In [4]:
%sql postgresql://postgres:070804@localhost:5432/testdb_1

# Set Operations in SQL (union/except/intersect and handling duplicates)

Recap: Consider R = {a, b, c} and S = {a, b, d, f}, then

$R \cap S = \{a, b\}$

$R \cup S = \{a,b,c,d,e,f\}$

$R - S = \{c\}$, and $S - R = \{d, f\}$

### In SQL,

```subquery``` INTERSECT ```subquery```

```subquery``` UNION ```subquery```

```subquery``` EXCEPT ```subquery```

**Q: Find actor_ids of actors that acted in both 'Hobbit Alien' and 'Sky Miracle' movie.**

In [5]:
%%sql select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
INTERSECT 
select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Sky Miracle'

 * postgresql://postgres:***@localhost:5432/testdb_1
4 rows affected.

[(159,), (119,), (102,), (22,)]

In [8]:
%%sql select actor.first_name, actor.last_name
from film join film_actor join actor on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
INTERSECT 
select film_actor.actor_id 
from film_actor join film join actor on film.film_id = film_actor.film_id where film.title = 'Sky Miracle'

 * postgresql://postgres:***@localhost:5432/testdb_1
(psycopg2.errors.SyntaxError) syntax error at or near "where"
LINE 2: ...m join actor on film.film_id = film_actor.film_id where film...
                                                             ^

[SQL: select actor.first_name, actor.last_name
from film_actor join film join actor on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
INTERSECT
select film_actor.actor_id
from film_actor join film join actor on film.film_id = film_actor.film_id where film.title = 'Sky Miracle']
(Background on this error at: https://sqlalche.me/e/20/f405)

**Q: Extend the above query to also find the name of the actor**

**Q: Find actor_ids of actors that acted in either 'Hobbit Alien' or 'Sky Miracle' movie.**

In [ ]:
%%sql select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
UNION 
select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Sky Miracle'

**Q: Extend the above query to also find the names of these actors.**

**Q: Retrieve actor ids of all actors that acted in 'Hobbit  Alien' but not in 'Sky Miracle'**

In [ ]:
%%sql select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
EXCEPT
select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Sky Miracle'

### Note on set operations in SQL
 
- SQL eliminates duplicate tuples! 
- To use bag semantics (retain duplicates), we use the keyword ```ALL``` e.g, 
    - ```UNION ALL```
    - ```INTERSECT ALL```
    - ```EXCEPT ALL```

**Q: Try out the above queries using multiset semantics and compare results.**

In [ ]:
%%sql select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Hobbit Alien'
UNION ALL
select film_actor.actor_id 
from film_actor join film on film.film_id = film_actor.film_id where film.title = 'Sky Miracle'

# Nested SQL Queries

* SQL provides a mechanism for the nesting of subqueries
* A **subquery** is a ```(SELECT-FROM-WHERE)``` statement, which can also be used as a value in ```FROM```, ```WHERE```, and ```SELECT``` clauses.
* Output of one query can be used as input to another
* **SQL is compositional**

Notes:
* Two types of nested queries
    1. Independent -- First inner query then outer query
    2. Corelated -- Inner query uses values from outer query (Slow!)

Nesting can be done in an SQL query
```
select A1, A2,...,An
from R1, R2,...,Rm
where P
```
as follows:
* **from clause:** $r_i$ can be replaved by any valid subquery
* **where clause:** $P$ can be replaced with an expression of the form:
    - $B$ \<operation\> (subquery)
    - *where B is an attribute and \<operation\> can be set comparison operator (see below for examples)*
* **select clause:** $A_i$ can be replaced by a subquery that generates a single value

**Q: Find title of all'PG' rated films that have length shorter than 50 minutes.**

In [10]:
%%sql select f.title 
from (select title, length from film where rating = 'PG') as f 
where f.length < 50;

 * postgresql://postgres:***@localhost:5432/testdb_1
7 rows affected.

[('Heaven Freedom',),
 ('Hurricane Affair',),
 ('Iron Moon',),
 ('Rush Goodfellas',),
 ('Pelican Comforts',),
 ('Shanghai Tycoon',),
 ('Suspects Quills',)]

**Q: Rewrite the above query by "unnesting" it.**

In [9]:
%%sql select f.title
from film as f
where f.rating = 'PG' and f.length < 50;

 * postgresql://postgres:***@localhost:5432/testdb_1
7 rows affected.

[('Heaven Freedom',),
 ('Hurricane Affair',),
 ('Iron Moon',),
 ('Rush Goodfellas',),
 ('Pelican Comforts',),
 ('Shanghai Tycoon',),
 ('Suspects Quills',)]

**Q: Find the average rental duration for film's ratings where the average rental duration is more than 5**

In [17]:
%%sql 
select f.rating, f.avg_rental_duration
from ( select rating, avg(rental_duration) as avg_rental_duration
    from film
    group by rating) f
where avg_rental_duration > 5

 * postgresql://postgres:***@localhost:5432/testdb_1
3 rows affected.

[('PG-13', Decimal('5.0538116591928251')),
 ('PG', Decimal('5.0824742268041237')),
 ('NC-17', Decimal('5.1428571428571429'))]

Q)using having clause do above task

In [18]:
%%sql
select f.rating, avg(f.rental_duration)
from film f
group by f.rating
having avg(f.rental_duration) > 5

 * postgresql://postgres:***@localhost:5432/testdb_1
3 rows affected.

[('PG-13', Decimal('5.0538116591928251')),
 ('PG', Decimal('5.0824742268041237')),
 ('NC-17', Decimal('5.1428571428571429'))]

## Set Membership

### ```IN``` Operator
* Specify multiple values in `where` clause
* Shorthand for multiple `OR`

**Q: Find all movie titles that have a running time of less than 100 minutes where the movie category is `Action'**

In [15]:
%%sql select f.title
from film f
where f.length < 100
and f.film_id IN (select fc.film_id
from film_category fc join category c on c.category_id = fc.category_id 
where c.name = 'Action')

 * postgresql://postgres:***@localhost:5432/testdb_1
26 rows affected.

[('Midnight Westward',),
 ('Devil Desire',),
 ('Dances None',),
 ('Rings Heartbreakers',),
 ('Berets Agent',),
 ('Fantasy Troopers',),
 ('Clueless Bucket',),
 ('Lust Lock',),
 ('Trip Newton',),
 ('Excitement Eve',),
 ('Grail Frankenstein',),
 ('Drifter Commandments',),
 ('Bride Intrigue',),
 ('Hills Neighbors',),
 ('Truman Crazy',),
 ('Caddyshack Jedi',),
 ('Werewolf Lola',),
 ('Forrest Sons',),
 ('Waterfront Deliverance',),
 ('Rear Trading',),
 ('Mockingbird Hollywood',),
 ('Patriot Roman',),
 ('Ark Ridgemont',),
 ('Side Ark',),
 ('Suspects Quills',),
 ('Primary Glass',)]

**Q: Find all movie titles that have a running time of less than 100 minutes where the movie not an `Action' movie**

In [ ]:
%%sql select f.title
from film f
where f.length < 100
and f.film_id NOT IN (select fc.film_id
from film_category fc join category c on c.category_id = fc.category_id 
where c.name = 'Action')

## Set Comparison

### ```EXISTS``` Operator (Set comparison)
* checks existence of any tuple in a subquery
* The exists construct returns the value **true** if the argument subquery is non-empty
    - EXISTS $r \iff r \neq \emptyset$
    - NOT EXISTS $r \iff r = \emptyset$

**Q: Find all movie titles that have a running time of less than 100 minutes where the movie category is `Action'**

* Note here that the subquery here is correlated subquery (variable $f$ is also used inside the subquery)

In [ ]:
%%sql select f.title
from film f
where f.length < 100
and EXISTS (select *
    from film_category fc join category c on c.category_id = fc.category_id 
    where c.name = 'Action'
    and fc.film_id = f.film_id
    )

**Q: Retrieve all actors who have only acted in movies with length greater than or equal to 100 minutes.**

In [ ]:
%%sql select distinct actor.actor_id, actor.first_name, actor.last_name
from actor
join film_actor on actor.actor_id = film_actor.actor_id
and NOT EXISTS (
    select *
    from film f
    where f.film_id = film_actor.film_id
    and f.length < 100
);

### `ANY` Operator (Set comparison)
* Compare with a range of values
* $F \text{<comp> ANY } r \iff \exists t \in r \text{ such that } (F \text{<comp>} t)$
    - where \<comp\> can be $<,\le,>,\ge,\neq$
* Examples
    - (10 < ANY (1, 12, 4)) = true
    - (10 < ANY (1, 6, 4)) = false
    - (10 = ANY (1, 12, 10)) = true
    - (10 $\neq$ ANY (1, 12, 10)) = true

**Q: Find all actors that have acted in some movie with length less than 100 minutes.**

In [ ]:
%%sql select distinct actor.actor_id, actor.first_name, actor.last_name
from actor
join film_actor on actor.actor_id = film_actor.actor_id
where 100 > ANY (
    select length
    from film f
    where f.film_id = film_actor.film_id
);

### `ALL` (Set comparison)
* like `ANY` but all values must meet the condition
* $F \text{<comp> ALL } r \iff \forall t \in r (F \text{<comp>} t)$
* Examples
    - (10 < ALL (1, 12, 4)) = false
    - (10 < ALL (11, 12, 14)) = true
    - (10 = ALL (1, 12, 10)) = false
    - (10 $\neq$ ALL (1, 12, 11)) = true

**Q: Retrieve all actors who have only acted in movies with length greater than or equal to 100 minutes.**

In [ ]:
%%sql select distinct actor.actor_id, actor.first_name, actor.last_name
from actor
join film_actor on actor.actor_id = film_actor.actor_id
where 100 <= ALL (
    select f.length
    from film f
    where f.film_id = film_actor.film_id
);

# Exercises

**Q: Find names of all actors and customers.**
* Hint: use `union`

In [30]:
%%sql
select f.first_name,f.last_name
from actor as f
UNION
select c.first_name,c.last_name
from customer as c
LIMIT 1

 * postgresql://postgres:***@localhost:5432/testdb_1
1 rows affected.

[('Dolores', 'Wagner')]

**Q: Find all actors who share their names (first and last) with customers.**
* Hint: use `intersect`

In [27]:
%%sql
select f.first_name,f.last_name
from actor as f
INTERSECT
select c.first_name,c.last_name
from customer as c

 * postgresql://postgres:***@localhost:5432/testdb_1
1 rows affected.

[('Jennifer', 'Davis')]

**Q: Write a query to find all films that have the same rental rate as the film 'American Circus'.**
* Hint: use a nested subquery in `where` clause

**Q: Find the average rental duration for each film category, comparing it to the overall average duration.**

**Q: Find all customers (first_name and last_name) who have rented films in the same category as that of the film 'American Circus'.**
* Hint: use a correlated subquery